announcements/deriving-a-light-weight-kbd-reader.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-10 Sat 07:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Extracting A Light-Weight Key-Sequence Reader By Progressive Simplification</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">Extracting A Light-Weight Key-Sequence Reader By Progressive Simplification</h1>
<div id="outline-container-orgac4008b" class="outline-2">
<h2 id="orgac4008b"><span class="section-number-2">1</span> Background</h2>
<div class="outline-text-2" id="text-1">
<p>
In the previous article entitled <a href="https://emacspeak.blogspot.com/2020/10/on-defining-keys-in-emacs.html">On Defining Keys In Emacs</a> I covered
the issue of declaring key-sequences when defining keyboard
short-cuts.  During the last week, I took the underlying Emacs Lisp
function <code>edmacro-parse-key</code> and via a process of progressive
simplification derived a new <code>new-kbd</code> function that is much simpler
and consequently easier to understand.  You can see the step-by-step
simplification via the Git history for file <a href="https://github.com/tvraman/emacspeak/blob/master/lisp/new-kbd.el#L1">new-kbd.el</a> (note: used to
be called <code>ems-kbd.el</code>).  That file contains the final version of the
simplified function, along with a test-suite that verifies that it's
behavior is convenient with the solution built into Emacs. The updated
function is now part of Emacspeak and is named <code>ems-kbd</code> in that
package.
</p>

<p>
The next section gives a high-level overview of the steps that led to
the final version.
</p>
</div>
</div>

<div id="outline-container-orgc5fe474" class="outline-2">
<h2 id="orgc5fe474"><span class="section-number-2">2</span> Steps Toward Simplification</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgaaa6d11" class="outline-3">
<h3 id="orgaaa6d11"><span class="section-number-3">2.1</span> Separate Tokenization From Processing</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Function <code>edmacro-parse-keys</code> 
interweaves  the process of tokenizing its input string  and how
various parts of that string are processed in a single <code>while</code> loop.
</p>

<p>
The first  step in simplification was to separate these steps, by 
using function <code>split-string</code> to split the input string on
<span class="underline">whitespace</span> to generate a list of words.
</p>

<p>
A simple <code>cl-loop</code> is then used to turn each <code>word</code> into a <code>key</code> that
is accumulated into a result vector.
</p>
</div>
</div>

<div id="outline-container-orge871f14" class="outline-3">
<h3 id="orge871f14"><span class="section-number-3">2.2</span> Refactoring Case Analysis</h3>
<div class="outline-text-3" id="text-2-2">
<p>
 Once tokenization is factored out, 
the remainder of function <code>edmacro-parse-keys</code> 
converts each key-specification into either the corresponding string
or vector representation.
</p>

<p>
The original requirement of parsing  the serialization of
keyboard-macros brought along additional logic that I first
eliminated, since my goal was to create a function to be used in
defining keyboard-shortcuts.
</p>

<ul class="org-ul">
<li>I eliminated code that handled invocation of <code>M-x
    execute-extended-command</code> during a keyboard-macro.</li>
<li>I eliminated processing of comments within the keyboard-macro serialization.</li>
</ul>
</div>
</div>

<div id="outline-container-org349e909" class="outline-3">
<h3 id="org349e909"><span class="section-number-3">2.3</span> Rearranging Conditionals</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Next, I rearranged conditionals and in that process eliminated <code>cond</code>
clauses that were now effectively dead-code.
</p>

<p>
In the process, I also eliminated   test-predicates that had
side-effects  to hopefully result in less fragile code.
</p>
</div>
</div>

<div id="outline-container-org7af7bb1" class="outline-3">
<h3 id="org7af7bb1"><span class="section-number-3">2.4</span> Lexically Bind Regex Patterns</h3>
<div class="outline-text-3" id="text-2-4">
<p>
To improve readability, I created let-bindings to some of the regex
patterns used to identify key-sequence patterns.
In the process, I also made these more readable by using <span class="underline">[:space:]</span>
for white-space tests.
</p>
</div>
</div>



<div id="outline-container-org139056e" class="outline-3">
<h3 id="org139056e"><span class="section-number-3">2.5</span> Always Return A Vector</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Finally, I setup the new function to always return a vector; function
<code>edmacro-parse-keys</code> returns either a string or a vector  based on how
it is called. 
Since Emacs now takes a vector in every context  where a key-sequence
is expected, this simplification does not break  when using our
simplified function for  defining keys.
</p>

<div class="org-src-container">
<pre class="src src-emacs-list">   (defun new-kbd (string )
  "Simplified and hopefully more robust kbd function.
Always returns a vector i.e. like passing need-vector to edmacro-parse-keys. "
  (let ((res [])
        (special-char-reg "^\\(NUL\\|RET\\|LFD\\|ESC\\|SPC\\|DEL\\)$")
        (modifier+angle-reg "^\\(\\([ACHMsS]-\\)*\\)&lt;\\(.+\\)&gt;$"))
    (cl-loop
     for word in (split-string string)
     do
     (let* ((key nil))
       (cond 
        ((and ;;; modifier+-&lt;key&gt; without DEL etc
          (not (string-match special-char-reg word))
          (string-match modifier+angle-reg word))
         (setq key
               (list
                (intern 
                 (concat ;;; strip &lt; and &gt;
                  (substring word (match-beginning 1) (match-end 1))
                  (substring word (match-beginning 3) (match-end 3)))))))
        (t
         (let ((prefix 0)
               (bits 0))
           (while ;;; calculate modifier bits
               (string-match "^[ACHMsS]-." word)
             (cl-incf bits
                      (cdr
                       (assq (aref word 0)
                             '((?A . ?\A-\^@)
                               (?C . ?\C-\^@)
                               (?H . ?\H-\^@)
                               (?M . ?\M-\^@)
                               (?s . ?\s-\^@)
                               (?S . ?\S-\^@)))))
             (cl-incf prefix 2)
             (cl-callf substring word 2))
           (when (string-match "^\\^.$" word)
             (cl-incf bits ?\C-\^@)
             (cl-incf prefix)
             (cl-callf substring word 1))
           (when-let
               (found
                (assoc word
                       '(("NUL" . "\0")
                         ("RET" . "\r")
                         ("LFD" . "\n")
                         ("TAB" . "\t")
                         ("ESC" . "\e")
                         ("SPC" . " ")
                         ("DEL" . "\177"))))
             (setq word (cdr found)))
           (cond ;;; apply modifiers 
            ((= bits 0) (setq key word))
            ((/= (length word) 1)
             (error "%s: Prefix  must precede a single character, not %s"
                    string word))
            ((and
              (/= (logand bits ?\C-\^@) 0)
              (string-match "[@-_a-z]" word))
             (setq key
                   (list (+ bits (- ?\C-\^@)
                            (logand (aref word 0) 31)))))
            (t (setq key (list (+ bits (aref word 0)))))))))
;;; push key on to the result vector 
       (when key (cl-callf vconcat res key))))
    res))
</pre>
</div>


<p>
You can verify the code above by running the tests found at the end of
file  <code>new-kbd.el</code> &#x2014; the tests were extracted from the various
patterns described in the Elisp Reference, as well as  by reading the
code in <code>edmacro-parse-keys</code>.
</p>
</div>
</div>


<div id="outline-container-org0923351" class="outline-3">
<h3 id="org0923351"><span class="section-number-3">2.6</span> Closing Thoughts</h3>
<div class="outline-text-3" id="text-2-6">
<p>
The above simplification exercise was done by:
</p>

<ol class="org-ol">
<li>Starting with the original <code>edmacro-parse-keys</code> copied over to a
new file and renamed to function <code>new-kbd</code>.</li>
<li>Adding a set of tests at the end of file, essentially this is a
<code>let</code> that binds a set of tests, then compares the result of
calling our new function on each value with that returned by the original.</li>
<li>Modifying and simplifying our new function and running
<code>eval-buffer</code> after each step.</li>
<li>It was a fun exercise to see order emerge from chaos at each step!</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-10-09 Fri 00:00</p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2020-10-10 Sat 07:25</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
